<template>
  <div class="mt-3">
    <b-button variant="light" v-b-modal.helpmodal><b-icon-exclamation-triangle /> 注意事項と使い方</b-button>
    <b-modal id="helpmodal" title="注意事項と使い方" size="lg" ok-only>
      <h5>注意事項</h5>
      <ul>
        <li>本ツールは非公式かつ利用は自己責任です。ツールの不具合で成績が悪くなっても責任は取れません</li>
        <li>もし不具合を見つけた場合、フッターのリンクからGitHubでIssueを開いていただけると幸いです</li>
        <li>例外処理は未実装のため、無効なファイルなどを選択した場合、特にエラーは出ませんが操作不能になります</li>
        <li>本ツールの処理はクライアントで完結しており、使用したファイルが外部に送信されることはありません</li>
        <li>本ツールは予告なく公開終了する可能性があります</li>
        <li>拡張実装には対応しておりません</li>
      </ul>
      <h5>使い方</h5>
      <ol>
        <li>入力ファイルと出力ファイルを選択し、「読み込み」ボタンを押してください</li>
        <li>
          各自のプログラムの動作を検証する場合、出力を<a
            href="https://qiita.com/progrhyme/items/e99be732c2e62d4a7641"
            target="_blank"
            rel="noopener">ファイルにリダイレクト</a>すると良いでしょう
        </li>
        <li>キャンバスに格子状のマップが表示されていることを確認してください</li>
        <li>各エージェントの色が見にくいときは、再度「読み込む」ボタンを押してください</li>
        <li>「Next」ボタンで次のサイクルに、「Prev」ボタンで前のサイクルに遷移します</li>
        <li>エージェントの現在の状態が円の中に数字で表示されます。向きは矢印で表示されます</li>
        <li>表示が重なっている場合があるので注意してください(気が向いたら修正予定)</li>
      </ol>
    </b-modal>
  </div>
</template>
